transonic-bump/setups.orig/iddesGammaTheta/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/freestreamConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }

    outlet
    {
        //type            inletOutlet;
        //inletValue      uniform $Uinlet;
        //value           $internalField;
       // type            fixedValue;
       // value           $internalField;
        type            zeroGradient;
    }



    top
    {
        type            symmetry;
    }


    obstacle
    {
            type            boundaryCorrectedFixedValue;
            value           uniform (0 0 0);
    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }


    front
    {
        type            wedge;
    }
    
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
